Revit 2027 API
ParameterSet.Erase Method
Removes a specified parameter from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	Parameter item
)
Public Overridable Function Erase (
	item As Parameter
) As Integer
public:
virtual int Erase(
	Parameter^ item
)
abstract Erase :
        item : Parameter -> int
override Erase :
        item : Parameter -> int
Parameters
item Parameter
The parameter to be erased.
Return Value
Int32
The number of parameters that were erased from the set.
See Also
Reference
ParameterSet Class
Autodesk.Revit.DB Namespace